[Killed] ArrayDeclaration
main/components/HelpRequest/HelpRequestTable.jsx:33:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    { header: "Id", accessorKey: "id" },
-    { header: "Requester Email", accessorKey: "requesterEmail" },
-    { header: "Team Id", accessorKey: "teamId" },
-    { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
-    { header: "Request Time (ISO Format)", accessorKey: "requestTime" },
-    { header: "Explanation", accessorKey: "explanation" },
-    { header: "Solved", accessorKey: "solved" },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:34:34
   };
 
   const columns = [
-    { header: "Id", accessorKey: "id" },
+    { header: "Id", accessorKey: "" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Team Id", accessorKey: "teamId" },
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:35:5
 
   const columns = [
     { header: "Id", accessorKey: "id" },
-    { header: "Requester Email", accessorKey: "requesterEmail" },
+    {},
     { header: "Team Id", accessorKey: "teamId" },
     { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:35:47
 
   const columns = [
     { header: "Id", accessorKey: "id" },
-    { header: "Requester Email", accessorKey: "requesterEmail" },
+    { header: "Requester Email", accessorKey: "" },
     { header: "Team Id", accessorKey: "teamId" },
     { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:37:54
     { header: "Id", accessorKey: "id" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Team Id", accessorKey: "teamId" },
-    { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
+    { header: "Table Or Breakout Room", accessorKey: "" },
     { header: "Request Time (ISO Format)", accessorKey: "requestTime" },
     { header: "Explanation", accessorKey: "explanation" },
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-tableOrBreakoutRoom"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:38:15
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Team Id", accessorKey: "teamId" },
     { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
-    { header: "Request Time (ISO Format)", accessorKey: "requestTime" },
+    { header: "", accessorKey: "requestTime" },
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Solved", accessorKey: "solved" },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Request Time (ISO Format). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:38:5
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Team Id", accessorKey: "teamId" },
     { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
-    { header: "Request Time (ISO Format)", accessorKey: "requestTime" },
+    {},
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Solved", accessorKey: "solved" },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:40:5
     { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
     { header: "Request Time (ISO Format)", accessorKey: "requestTime" },
     { header: "Explanation", accessorKey: "explanation" },
-    { header: "Solved", accessorKey: "solved" },
+    {},
   ];
 
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:40:38
     { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
     { header: "Request Time (ISO Format)", accessorKey: "requestTime" },
     { header: "Explanation", accessorKey: "explanation" },
-    { header: "Solved", accessorKey: "solved" },
+    { header: "Solved", accessorKey: "" },
   ];
 
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-solved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:52:66
     );
   }
 
-  return <OurTable data={helpRequests} columns={columns} testid={"HelpRequestTable"} />;
+  return <OurTable data={helpRequests} columns={columns} testid={""} />;
 }
 
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""
