[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.jsx:21:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New Help Request created - id: ${helpRequest.id}, requester: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
