[Killed] BooleanLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:8:48
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const addSeconds = (s) => s.includes(':') && !s.includes(':', s.lastIndexOf(':') + 1) ? `${s}:00` : s;
+  const addSeconds = (s) => s.includes(':') && s.includes(':', s.lastIndexOf(':') + 1) ? `${s}:00` : s;
 
   const objectToAxiosParams = (recommendationRequest) => ({
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationRequests
statusReason: expected '2025-10-10T12:00' to match /^2025-10-10T12:00:00$/

[Killed] ArithmeticOperator
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:8:65
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const addSeconds = (s) => s.includes(':') && !s.includes(':', s.lastIndexOf(':') + 1) ? `${s}:00` : s;
+  const addSeconds = (s) => s.includes(':') && !s.includes(':', s.lastIndexOf(':') - 1) ? `${s}:00` : s;
 
   const objectToAxiosParams = (recommendationRequest) => ({
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationRequests
statusReason: expected '2025-10-10T12:00' to match /^2025-10-10T12:00:00$/

[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:10:31
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   const addSeconds = (s) => s.includes(':') && !s.includes(':', s.lastIndexOf(':') + 1) ? `${s}:00` : s;
 
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: addSeconds(recommendationRequest.dateRequested),
-      dateNeeded: addSeconds(recommendationRequest.dateNeeded),
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationRequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
