[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:8:16
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const addZ = (s) => `${s}Z`;
+  const addZ = () => undefined;
 
   const objectToAxiosParams = (recommendationRequest) => ({
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationRequests
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:10:31
 export default function RecommendationRequestCreatePage({ storybook = false }) {
   const addZ = (s) => `${s}Z`;
 
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: addZ(recommendationRequest.dateRequested),
-      dateNeeded: addZ(recommendationRequest.dateNeeded),
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationRequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:25:7
 
   const onSuccess = (recommendationRequest) => {
     toast(
-      `New Recommendation Request Created - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationRequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New Recommendation Request Created - id: 1 requesterEmail: student2@ucsb.edu",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:42:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/RecommendationRequest" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationRequests
statusReason: expected "spy" to be called with arguments: [ { to: '/RecommendationRequest' } ]

Number of calls: 0
