[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/recommendationRequest/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: recommendationRequestTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/recommendationRequest/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/recommendationRequest/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: recommendationRequestTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/recommendationRequest/edit/1' ]

Received: 

  1st spy call:

  [
-   "/recommendationRequest/edit/1",

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.jsx:39:15
 
   const columns = [
     {
-      header: "Id",
+      header: "",
       accessorKey: "id", // accessor is the "key" in the data
     },
killedBy: recommendationRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="recommendationRequestTable"
