[Killed] OptionalChaining
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:31:18
           id="orgCode"
           type="text"
           {...register("orgCode")}
-          value={initialContents?.orgCode}
+          value={initialContents.orgCode}
           disabled={initialContents}
         />
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'orgCode')

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:46:24
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
           {...register("orgTranslationShort", {
-            maxLength: { value: 30, message: "Max length 30 characters" },
+            maxLength: {},
             required: "Short Organization Translation is required.",
           })}
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
